<a href="https://colab.research.google.com/github/rinnarachma/latihan-DA/blob/main/Data_Manipulation2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Manipulation and Transformation

In [1]:
# Mengimport library pandas dan numpy
import pandas as pd
import numpy as np

In [3]:
!

In [ ]:
# Load file startup.csv
data = pd.read_csv('startup.csv')
data

   No    company  order  qty  unit_price
0   0     Go-Jek  10001   30       30000
1   1       Grab  10002   23       39000
2   2        OVO  10004   45       56000
3   3  Tokopedia  10004   67       39000
4   4  Bukalapak  10006   34       32800
5   5     Shopee  10006   23       27890

In [ ]:
# Mengubah menjadi Data Frame
df = pd.DataFrame(data)
df.head()

   No    company  order  qty  unit_price
0   0     Go-Jek  10001   30       30000
1   1       Grab  10002   23       39000
2   2        OVO  10004   45       56000
3   3  Tokopedia  10004   67       39000
4   4  Bukalapak  10006   34       32800

In [ ]:
# Melihat ukuran dimensi data (baris dan kolom)
df.shape

(6, 5)

In [ ]:
# Membuat kolom baru dengan mengunakan 2 kategori
df['price_group'] = np.where(df['unit_price']>=35000, 'high', 'low')
df

   No    company  order  qty  unit_price price_group
0   0     Go-Jek  10001   30       30000         low
1   1       Grab  10002   23       39000        high
2   2        OVO  10004   45       56000        high
3   3  Tokopedia  10004   67       39000        high
4   4  Bukalapak  10006   34       32800         low
5   5     Shopee  10006   23       27890         low

### Q & A
*Bagaimana kalo ingin membuatnya menjadi 3 kategori?*

In [ ]:
# Cara 1 - Menggunakan np.where
df['price_level'] = np.where(df['unit_price']>=50000, 'high', (np.where(df['unit_price'] <= 30000, 'low', 'medium')))
df

   No    company  order  qty  unit_price price_group price_level
0   0     Go-Jek  10001   30       30000         low         low
1   1       Grab  10002   23       39000        high      medium
2   2        OVO  10004   45       56000        high        high
3   3  Tokopedia  10004   67       39000        high      medium
4   4  Bukalapak  10006   34       32800         low      medium
5   5     Shopee  10006   23       27890         low         low

In [ ]:
# Cara 2 - Menggunakan np.select
conditions  = [ df['unit_price']>=50000, (df['unit_price']<50000) & (df['unit_price']>30000), df['unit_price'] <= 30000]
choices     = [ "high", 'medium', 'low' ]

df["level_harga"] = np.select(conditions, choices, default=np.nan)
df

   No    company  order  qty  unit_price price_group price_level level_harga
0   0     Go-Jek  10001   30       30000         low         low         low
1   1       Grab  10002   23       39000        high      medium      medium
2   2        OVO  10004   45       56000        high        high        high
3   3  Tokopedia  10004   67       39000        high      medium      medium
4   4  Bukalapak  10006   34       32800         low      medium      medium
5   5     Shopee  10006   23       27890         low         low         low

In [ ]:
# Cara 3 - Menggunakan np.vectorize dan membuat function
def level(x):
    if x >=50000:
        return "High"
    elif x >30000:
        return "Medium"
    else:
        return "Low"

func = np.vectorize(level)
df["level_harga2"] = func(df["unit_price"])
df

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2
0,0,Go-Jek,10001,30,30000,low,low,low,Low
1,1,Grab,10002,23,39000,high,medium,medium,Medium
2,2,OVO,10004,45,56000,high,high,high,High
3,3,Tokopedia,10004,67,39000,high,medium,medium,Medium
4,4,Bukalapak,10006,34,32800,low,medium,medium,Medium
5,5,Shopee,10006,23,27890,low,low,low,Low

In [ ]:
# Cara 4 - Menggunakan pd.cut untuk memisahkan kolom dari data frame
import copy
df2 = copy.deepcopy(df)
df2 = pd.cut(df.unit_price, [0, 30000, 50000, np.inf], labels=['low','medium','high'])
df2

0       low
1    medium
2      high
3    medium
4    medium
5       low
Name: unit_price, dtype: category
Categories (3, object): [low < medium < high]

***

In [ ]:
# Membuat kolom baru dengan menggunakan komputasi
df["total_price"] = df["qty"]*df["unit_price"]
df["qty_log"] = np.log(df["qty"])
df

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log
0,0,Go-Jek,10001,30,30000,low,low,low,Low,900000,3.401197
1,1,Grab,10002,23,39000,high,medium,medium,Medium,897000,3.135494
2,2,OVO,10004,45,56000,high,high,high,High,2520000,3.806662
3,3,Tokopedia,10004,67,39000,high,medium,medium,Medium,2613000,4.204693
4,4,Bukalapak,10006,34,32800,low,medium,medium,Medium,1115200,3.526361
5,5,Shopee,10006,23,27890,low,low,low,Low,641470,3.135494

In [ ]:
# Membuat kolom dengan menggunakan fungsi 'transform'
df["qty_log2"] = df['qty'].transform(lambda x: np.log(x))
df

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log,qty_log2
0,0,Go-Jek,10001,30,30000,low,low,low,Low,900000,3.401197,3.401197
1,1,Grab,10002,23,39000,high,medium,medium,Medium,897000,3.135494,3.135494
2,2,OVO,10004,45,56000,high,high,high,High,2520000,3.806662,3.806662
3,3,Tokopedia,10004,67,39000,high,medium,medium,Medium,2613000,4.204693,4.204693
4,4,Bukalapak,10006,34,32800,low,medium,medium,Medium,1115200,3.526361,3.526361
5,5,Shopee,10006,23,27890,low,low,low,Low,641470,3.135494,3.135494

In [ ]:
# Melihat rata-rata pada kolom tertentu
df['qty'].mean()

37.0

In [ ]:
# Membuat kolom dengan menggunakan fungsi 'transform'
df.groupby('order')['qty'].transform(lambda x: x/x.mean())

0    1.000000
1    1.000000
2    0.803571
3    1.196429
4    1.192982
5    0.807018
Name: qty, dtype: float64

## Split Data Numeric & Data Categorical

In [ ]:
# Memilih Kolom Numerik
numeric = set(df._get_numeric_data().columns.values)
numeric

{'No', 'order', 'qty', 'qty_log', 'qty_log2', 'total_price', 'unit_price'}

In [ ]:
df

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log,qty_log2
0,0,Go-Jek,10001,30,30000,low,low,low,Low,900000,3.401197,3.401197
1,1,Grab,10002,23,39000,high,medium,medium,Medium,897000,3.135494,3.135494
2,2,OVO,10004,45,56000,high,high,high,High,2520000,3.806662,3.806662
3,3,Tokopedia,10004,67,39000,high,medium,medium,Medium,2613000,4.204693,4.204693
4,4,Bukalapak,10006,34,32800,low,medium,medium,Medium,1115200,3.526361,3.526361
5,5,Shopee,10006,23,27890,low,low,low,Low,641470,3.135494,3.135494

In [ ]:
# Memilih Kolom Numerik
# Note: cara ini lebih efektif
num = df.select_dtypes(include=[np.number])
num.columns

Index(['No', 'order', 'qty', 'unit_price', 'total_price', 'qty_log',
       'qty_log2'],
      dtype='object')

In [ ]:
# Mengecek Tipe Data Numerik
num

   No  order  qty  unit_price  total_price   qty_log  qty_log2
0   0  10001   30       30000       900000  3.401197  3.401197
1   1  10002   23       39000       897000  3.135494  3.135494
2   2  10004   45       56000      2520000  3.806662  3.806662
3   3  10004   67       39000      2613000  4.204693  4.204693
4   4  10006   34       32800      1115200  3.526361  3.526361
5   5  10006   23       27890       641470  3.135494  3.135494

In [ ]:
# Memilih Kolom Kategorik
categ = df.select_dtypes(exclude=[np.number])
categ.columns

Index(['company', 'price_group', 'price_level', 'level_harga', 'level_harga2'], dtype='object')

In [ ]:
# Mengecek Tipe Data Kategorik
categ

     company price_group price_level level_harga level_harga2
0     Go-Jek         low         low         low          Low
1       Grab        high      medium      medium       Medium
2        OVO        high        high        high         High
3  Tokopedia        high      medium      medium       Medium
4  Bukalapak         low      medium      medium       Medium
5     Shopee         low         low         low          Low

In [ ]:
# Hapus kolom yang tidak diperlukan dari data frame num
num = num.drop(columns = 'No')
num

   order  qty  unit_price  total_price   qty_log  qty_log2
0  10001   30       30000       900000  3.401197  3.401197
1  10002   23       39000       897000  3.135494  3.135494
2  10004   45       56000      2520000  3.806662  3.806662
3  10004   67       39000      2613000  4.204693  4.204693
4  10006   34       32800      1115200  3.526361  3.526361
5  10006   23       27890       641470  3.135494  3.135494

In [ ]:
# Hapus kolom yang tidak diperlukan dari data frame df
df_num = df[numeric]
df_num = df_num.drop(columns = 'No')
df_num

   total_price  unit_price  qty  qty_log2  order   qty_log
0       900000       30000   30  3.401197  10001  3.401197
1       897000       39000   23  3.135494  10002  3.135494
2      2520000       56000   45  3.806662  10004  3.806662
3      2613000       39000   67  4.204693  10004  4.204693
4      1115200       32800   34  3.526361  10006  3.526361
5       641470       27890   23  3.135494  10006  3.135494

In [ ]:
# Mengecek kolom
df_num.columns

Index(['total_price', 'unit_price', 'qty', 'qty_log2', 'order', 'qty_log'], dtype='object')

## Normalisasi

In [ ]:
from sklearn import preprocessing

In [ ]:
# Normalisasi MinMax ke Skala 0-1 (menggunakan 'preprocessing' method dari scikit)
min_max_scaler = preprocessing.MinMaxScaler()
min_max_scaler

MinMaxScaler(copy=True, feature_range=(0, 1))

In [ ]:
# Fitting Normalisasi
np_scaled = min_max_scaler.fit_transform(df_num)
np_scaled

array([[0.13113166, 0.07506226, 0.15909091, 0.24850689, 0.        ,
        0.24850689],
       [0.12961   , 0.39523301, 0.        , 0.        , 0.2       ,
        0.        ],
       [0.95282851, 1.        , 0.5       , 0.62773034, 0.6       ,
        0.62773034],
       [1.        , 0.39523301, 1.        , 1.        , 0.6       ,
        1.        ],
       [0.24028546, 0.17467094, 0.25      , 0.36556948, 1.        ,
        0.36556948],
       [0.        , 0.        , 0.        , 0.        , 1.        ,
        0.        ]])

In [ ]:
# Membuat data frame dari hasil normalisasi dengan kolom yang sama
df_normalized = pd.DataFrame(np_scaled)
df_normalized.columns = ['total_price', 'qty_log2', 'order', 'qty', 'unit_price', 'qty_log']

In [ ]:
df_normalized

   total_price  qty_log2     order       qty  unit_price   qty_log
0     0.131132  0.075062  0.159091  0.248507         0.0  0.248507
1     0.129610  0.395233  0.000000  0.000000         0.2  0.000000
2     0.952829  1.000000  0.500000  0.627730         0.6  0.627730
3     1.000000  0.395233  1.000000  1.000000         0.6  1.000000
4     0.240285  0.174671  0.250000  0.365569         1.0  0.365569
5     0.000000  0.000000  0.000000  0.000000         1.0  0.000000

In [ ]:
# Normalisasi dengan kalkulasi manual
df_norm = (df_num - df_num.min())/(df_num.max() - df_num.min())
df_norm

   total_price  unit_price       qty  qty_log2  order   qty_log
0     0.131132    0.075062  0.159091  0.248507    0.0  0.248507
1     0.129610    0.395233  0.000000  0.000000    0.2  0.000000
2     0.952829    1.000000  0.500000  0.627730    0.6  0.627730
3     1.000000    0.395233  1.000000  1.000000    0.6  1.000000
4     0.240285    0.174671  0.250000  0.365569    1.0  0.365569
5     0.000000    0.000000  0.000000  0.000000    1.0  0.000000

In [ ]:
# Z-Score Normalization
df_norm = (df_num - df_num.mean())/df_num.std(ddof=0)
df_norm

   total_price  unit_price       qty  qty_log2     order   qty_log
0    -0.681926   -0.802067 -0.455983 -0.353484 -1.520526 -0.353484
1    -0.685661    0.167090 -0.911967 -1.055514 -0.983870 -1.055514
2     1.334803    1.997719  0.521124  0.717818  0.089443  0.717818
3     1.450578    0.167090  1.954214  1.769477  0.089443  1.769477
4    -0.414025   -0.500551 -0.195421 -0.022783  1.162755 -0.022783
5    -1.003769   -1.029280 -0.911967 -1.055514  1.162755 -1.055514

# Regex
Available in Python through package 're'
* Idea: Matching pattern in text
* Used for matching and modifying string

In [ ]:
# Import library regular expression
import re as re

### Extract Character

\w = mengambil alpha numerik<br>
\D = alpha nya saja<br>
\d = hanya numerik<br>

In [ ]:
print('Learning Python Programming 1991\n')

result = re.findall(r'\w', 'Learning Python Programming 1991')
print(result)

Learning Python Programming 1991

['L', 'e', 'a', 'r', 'n', 'i', 'n', 'g', 'P', 'y', 't', 'h', 'o', 'n', 'P', 'r', 'o', 'g', 'r', 'a', 'm', 'm', 'i', 'n', 'g', '1', '9', '9', '1']

In [ ]:
result = re.findall('\D', 'Learning Python Programming 1991')
print(result)

['L', 'e', 'a', 'r', 'n', 'i', 'n', 'g', ' ', 'P', 'y', 't', 'h', 'o', 'n', ' ', 'P', 'r', 'o', 'g', 'r', 'a', 'm', 'm', 'i', 'n', 'g', ' ']

In [ ]:
result = re.findall('\d', 'Learning Python Programming 1991')
print(result)

['1', '9', '9', '1']

### Extract Word

In [ ]:
result = re.findall(r'\w+', 'Learning Python Programming 1991')
print(result)

['Learning', 'Python', 'Programming', '1991']

In [ ]:
type(result)

list

### Extract Character after @ in email address

In [ ]:
result = re.findall(r'@\w+.\w+', 'abc.test@gmail.com, xyz@test.in, test.frist@yahoo.com, first.test@rest.biz')
print(result)

['@gmail.com', '@test.in', '@yahoo.com', '@rest.biz']

***

## Deep Copy

In [ ]:
import copy

In [ ]:
df_copy = copy.deepcopy(df)
df_copy

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log,qty_log2
0,0,Go-Jek,10001,30,30000,low,low,low,Low,900000,3.401197,3.401197
1,1,Grab,10002,23,39000,high,medium,medium,Medium,897000,3.135494,3.135494
2,2,OVO,10004,45,56000,high,high,high,High,2520000,3.806662,3.806662
3,3,Tokopedia,10004,67,39000,high,medium,medium,Medium,2613000,4.204693,4.204693
4,4,Bukalapak,10006,34,32800,low,medium,medium,Medium,1115200,3.526361,3.526361
5,5,Shopee,10006,23,27890,low,low,low,Low,641470,3.135494,3.135494

## Regex In Data Frame

In [ ]:
df_copy

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log,qty_log2
0,0,Go-Jek,10001,30,30000,low,low,low,Low,900000,3.401197,3.401197
1,1,Grab,10002,23,39000,high,medium,medium,Medium,897000,3.135494,3.135494
2,2,OVO,10004,45,56000,high,high,high,High,2520000,3.806662,3.806662
3,3,Tokopedia,10004,67,39000,high,medium,medium,Medium,2613000,4.204693,4.204693
4,4,Bukalapak,10006,34,32800,low,medium,medium,Medium,1115200,3.526361,3.526361
5,5,Shopee,10006,23,27890,low,low,low,Low,641470,3.135494,3.135494

### Q & A
*Bagaimana cara memecah huruf pada DataFrame menggunakan regex?*

In [ ]:
# Fungsi untuk mengambil alpha numerik
def perusahaan(company):
    return re.findall(r'(\D)', company)

In [ ]:
df_copy['company']

0       Go-Jek
1         Grab
2          OVO
3    Tokopedia
4    Bukalapak
5       Shopee
Name: company, dtype: object

In [ ]:
df_copy['company'] = df_copy['company'].apply(perusahaan)
df_copy['company']

0             [G, o, -, J, e, k]
1                   [G, r, a, b]
2                      [O, V, O]
3    [T, o, k, o, p, e, d, i, a]
4    [B, u, k, a, l, a, p, a, k]
5             [S, h, o, p, e, e]
Name: company, dtype: object

In [ ]:
df_copy

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log,qty_log2
0,0,"[G, o, -, J, e, k]",10001,30,30000,low,low,low,Low,900000,3.401197,3.401197
1,1,"[G, r, a, b]",10002,23,39000,high,medium,medium,Medium,897000,3.135494,3.135494
2,2,"[O, V, O]",10004,45,56000,high,high,high,High,2520000,3.806662,3.806662
3,3,"[T, o, k, o, p, e, d, i, a]",10004,67,39000,high,medium,medium,Medium,2613000,4.204693,4.204693
4,4,"[B, u, k, a, l, a, p, a, k]",10006,34,32800,low,medium,medium,Medium,1115200,3.526361,3.526361
5,5,"[S, h, o, p, e, e]",10006,23,27890,low,low,low,Low,641470,3.135494,3.135494

*Bagaimana kalo type datanya integer?*<br>
*- Harus dirubah terlebih dahulu menjadi type data string*

In [ ]:
def orderan(order):
    return re.findall(r'(\d)', order)

In [ ]:
df_copy['order'] = df_copy['order'].astype(str).apply(orderan)

In [ ]:
df_copy

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log,qty_log2
0,0,"[G, o, -, J, e, k]","[1, 0, 0, 0, 1]",30,30000,low,low,low,Low,900000,3.401197,3.401197
1,1,"[G, r, a, b]","[1, 0, 0, 0, 2]",23,39000,high,medium,medium,Medium,897000,3.135494,3.135494
2,2,"[O, V, O]","[1, 0, 0, 0, 4]",45,56000,high,high,high,High,2520000,3.806662,3.806662
3,3,"[T, o, k, o, p, e, d, i, a]","[1, 0, 0, 0, 4]",67,39000,high,medium,medium,Medium,2613000,4.204693,4.204693
4,4,"[B, u, k, a, l, a, p, a, k]","[1, 0, 0, 0, 6]",34,32800,low,medium,medium,Medium,1115200,3.526361,3.526361
5,5,"[S, h, o, p, e, e]","[1, 0, 0, 0, 6]",23,27890,low,low,low,Low,641470,3.135494,3.135494

In [ ]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 12 columns):
No              6 non-null int64
company         6 non-null object
order           6 non-null object
qty             6 non-null int64
unit_price      6 non-null int64
price_group     6 non-null object
price_level     6 non-null object
level_harga     6 non-null object
level_harga2    6 non-null object
total_price     6 non-null int64
qty_log         6 non-null float64
qty_log2        6 non-null float64
dtypes: float64(2), int64(4), object(6)
memory usage: 704.0+ bytes

***

In [ ]:
df

,No,company,order,qty,unit_price,price_group,price_level,level_harga,level_harga2,total_price,qty_log,qty_log2
0,0,Go-Jek,10001,30,30000,low,low,low,Low,900000,3.401197,3.401197
1,1,Grab,10002,23,39000,high,medium,medium,Medium,897000,3.135494,3.135494
2,2,OVO,10004,45,56000,high,high,high,High,2520000,3.806662,3.806662
3,3,Tokopedia,10004,67,39000,high,medium,medium,Medium,2613000,4.204693,4.204693
4,4,Bukalapak,10006,34,32800,low,medium,medium,Medium,1115200,3.526361,3.526361
5,5,Shopee,10006,23,27890,low,low,low,Low,641470,3.135494,3.135494

In [ ]:
com = list(df['company'])
com

['Go-Jek', 'Grab', 'OVO', 'Tokopedia', 'Bukalapak', 'Shopee']

In [ ]:
result = re.findall(r'\w', str(com))
print(result)

['G', 'o', 'J', 'e', 'k', 'G', 'r', 'a', 'b', 'O', 'V', 'O', 'T', 'o', 'k', 'o', 'p', 'e', 'd', 'i', 'a', 'B', 'u', 'k', 'a', 'l', 'a', 'p', 'a', 'k', 'S', 'h', 'o', 'p', 'e', 'e']

### Split string with multiple delimeters

In [ ]:
line = 'asdf fjdk;afed,fjek,asdf,foo'
result = re.split(r'[;,\s]', line)
print(result)

['asdf', 'fjdk', 'afed', 'fjek', 'asdf', 'foo']

In [ ]:
result = re.sub(r'[;,\s]',' ', line)
print(result)

asdf fjdk afed fjek asdf foo

***

## Join and Merge

In [ ]:
# Load data1
data1 = pd.read_csv('data1.csv')
data1

  X1      X2
0  a  11.432
1  b   1.303
2  c  99.906

In [ ]:
data1.columns = ['Y1','X2']

In [ ]:
data1

  Y1      X2
0  a  11.432
1  b   1.303
2  c  99.906

In [ ]:
# Load data2
data2 = pd.read_csv('data2.csv')
data2

  X1      X3
0  a  20.784
1  b     NaN
2  d  20.784

## Join
Pandas Join

In [ ]:
join = data1.join(data2, lsuffix='_left', rsuffix='_right')
join

  Y1      X2 X1      X3
0  a  11.432  a  20.784
1  b   1.303  b     NaN
2  c  99.906  d  20.784

In [ ]:
data1.columns = ['X1','X2']

## Merge
Pandas Merge (with left_index and right_index True, equal to Join)

In [ ]:
merge_left = pd.merge(data1, data2, how='left', on='X1')
merge_left

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN
2  c  99.906     NaN

In [ ]:
merge_right = pd.merge(data1, data2, how='right', on='X1')
merge_right

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN
2  d     NaN  20.784

In [ ]:
merge_natural = pd.merge(data1, data2, how='inner', on='X1')
merge_natural

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN

In [ ]:
merge_full = pd.merge(data1, data2, how='outer', on='X1')
merge_full

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN
2  c  99.906     NaN
3  d     NaN  20.784